
#Область ПрограммныйИнтерфейс

// Отправляет уведомления из справочника ВКМ_УведомленияТелеграмБоту в группу Telegram
Процедура УведомлениеТелеграмБоту() Экспорт  
		
	Ресурс = "bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	IDГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(); 
	
	Если НЕ ЗначениеЗаполнено(Токен) ИЛИ НЕ ЗначениеЗаполнено(IDГруппыДляОповещения) Тогда
		ЗаписьЖурналаРегистрации("ВКМ_Телеграм", УровеньЖурналаРегистрации.Ошибка,,, 
		"Не заполнены константы: ТокенУправленияТелеграмБотом или ИдентификаторГруппыДляОповещения");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Оповещение = Новый Структура;
		Оповещение.Вставить("chat_id", IDГруппыДляОповещения);
		Оповещение.Вставить("text", Выборка.ТекстСообщения);
		
		СтрокаJSON = ЗаписатьСтрокуJSON(Оповещение);
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);		
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		
		Если Ответ.КодСостояния = 200 Тогда
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Удалить();
		Иначе 
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
   				 ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка));

		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 Функция ЗаписатьСтрокуJSON(ОбъектДляЗаписи)

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	
	ЗаписатьJSON(Запись, ОбъектДляЗаписи);
		
	Возврат Запись.Закрыть();
	
КонецФункции

#КонецОбласти
