#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

#КонецОбласти       

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Заявка изменена. Новая дата проведения работ: %1.", Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"));
		ЗаписатьвСправочникИзменения(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВремяНачалаРаботПриИзменении(Элемент)

	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Заявка изменена. Новое время начала проведения работ: %1.", Объект.ВремяНачалаРабот);
		ЗаписатьвСправочникИзменения(ТекстСообщения);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРаботПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Заявка изменена. Новое время окончания проведения работ: %1.", Объект.ВремяОкончанияРабот);
		ЗаписатьвСправочникИзменения(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры    

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Заявка изменена. Назначен новый специалист: %1.", Объект.Специалист);
		ЗаписатьвСправочникИзменения(ТекстСообщения);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьвСправочникИзменения(ТекстСообщения)
	
	НовыйЭлементСправ = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовыйЭлементСправ.ТекстСообщения = ТекстСообщения;
	НовыйЭлементСправ.Записать();
	
КонецПроцедуры 

#КонецОбласти
