
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ОтпускаСотрудниковПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда) 
	
	Если Объект.ОтпускаСотрудников.Количество() <> 0 Тогда
		
		Результат = Ждать ВопросАсинх("Таблица будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;
	
	Объект.ОтпускаСотрудников.Очистить();
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);   	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ОтпускаСотрудников.НомерСтроки КАК НомерСтроки,
	|	РАЗНОСТЬДАТ(ОтпускаСотрудников.ДатаНачала, ОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1 КАК ПродолжительностьОтпуска
	|ПОМЕСТИТЬ ВТ_ОтпускаСотрудников
	|ИЗ
	|	&ОтпускаСотрудников КАК ОтпускаСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_ОтпускаСотрудников.ПродолжительностьОтпуска) КАК ПродолжительностьОтпуска
	|ПОМЕСТИТЬ ВТ_ОтпускаСгрупп
	|ИЗ
	|	ВТ_ОтпускаСотрудников КАК ВТ_ОтпускаСотрудников
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОтпускаСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтпускаСотрудников.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВТ_ОтпускаСгрупп.ПродолжительностьОтпуска, 0) КАК ПродолжительностьОтпуска
	|ИЗ
	|	ВТ_ОтпускаСотрудников КАК ВТ_ОтпускаСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтпускаСгрупп КАК ВТ_ОтпускаСгрупп
	|		ПО ВТ_ОтпускаСотрудников.Сотрудник = ВТ_ОтпускаСгрупп.Сотрудник";
	
	
	ОтпускаСотр = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник,НомерСтроки,ДатаНачала,ДатаОкончания" );
	Запрос.УстановитьПараметр("ОтпускаСотрудников",ОтпускаСотр);
	
	ТаблицаОтпусков = Запрос.Выполнить().Выбрать();   
	
	Пока ТаблицаОтпусков.Следующий() Цикл
		Объект.ОтпускаСотрудников[ТаблицаОтпусков.НомерСтроки - 1].ПродолжительностьОтпуска = ТаблицаОтпусков.ПродолжительностьОтпуска;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере                                       
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);  
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BKM_Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.ВКМ_Сотрудники КАК BKM_Сотрудники
	|ГДЕ
	|	НЕ BKM_Сотрудники.ПометкаУдаления";
	
	СписокСотрудников = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СписокСотрудников,Объект.ОтпускаСотрудников);
	
КонецПроцедуры

#КонецОбласти
