#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
// Создает реализации товаров и услуг по договорам за период
// Параметры:
//   Период - СтандартныйПериод - период, за который создаются реализации
//
// Возвращаемое значение:
// Неопределено
Функция СозданиеРеализаций(Период) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора КАК НачалоДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора КАК ОкончаниеДействияДоговора,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДоговорыКонтрагентов.Организация = РеализацияТоваровУслуг.Организация
	|			И ДоговорыКонтрагентов.Владелец = РеализацияТоваровУслуг.Контрагент
	|			И ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ))
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &НачалоПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода",Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	МассивДоговоров = Новый Массив;
	МассивРеализаций = Новый Массив;
	МассивДоговоровИРеализаций = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Реализация) Тогда
			МассивДоговоров.Добавить(Выборка.Договор);  
			МассивРеализаций.Добавить(Выборка.Реализация);			
		Иначе		
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();		
			ДокументРеализация.Дата = Период.ДатаОкончания; 
			ДокументРеализация.Заполнить(Выборка.Договор); 
			ДокументРеализация.Организация = Выборка.Организация;
			ДокументРеализация.Контрагент = Выборка.Контрагент;
			ДокументРеализация.Договор = Выборка.Договор;
			ДокументРеализация.ВыполнитьАвтозаполнение();		
			ДокументРеализация.ПроверитьЗаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			МассивДоговоров.Добавить(Выборка.Договор);  
			МассивРеализаций.Добавить(Выборка.Реализация);			
		КонецЕсли;	
		
		МассивДоговоровИРеализаций.Добавить(МассивДоговоров);
		МассивДоговоровИРеализаций.Добавить(МассивРеализаций);
		
	КонецЦикла;
	
	Возврат МассивДоговоровИРеализаций;	
		
КонецФункции 
#КонецОбласти 
		
#КонецЕсли