#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
// Создает реализации товаров и услуг по договорам за период
// Параметры:
//   Договоры - Массив из СправочникСсылка.ДоговорыКонтрагентов - массив договоров/договор для создания реализаций
//   Период - СтандартныйПериод - период, за который создаются реализации
//
// Возвращаемое значение:
// Неопределено
Функция СозданиеРеализаций(Период) Экспорт 
		
	МассивДоговоров = Новый Массив;
	МассивРеализаций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ДоговорыКонтрагентов.Владелец.Ссылка КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор.Ссылка
	|			И (РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора <= &КонецПериода
	|	И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора >= &НачалоПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("НачалоПериода",Период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивДоговоров.Добавить(Выборка.Договор);  
		
		Если ЗначениеЗаполнено(Выборка.Реализация) Тогда
			МассивРеализаций.Добавить(Выборка.Реализация) 
		Иначе		
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();		
			ДокументРеализация.Дата = Период.ДатаОкончания; 
			ДокументРеализация.Заполнить(Выборка.Договор); 
			ДокументРеализация.Организация = Выборка.Организация;
			ДокументРеализация.Контрагент = Выборка.Контрагент;
			ДокументРеализация.Договор = Выборка.Договор;
			ДокументРеализация.ВыполнитьАвтозаполнение();		
			ДокументРеализация.ПроверитьЗаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			МассивРеализаций.Добавить(ДокументРеализация.Ссылка);
		КонецЕсли;		
		
		МассивДоговоровИРеализаций = Новый Массив;
		МассивДоговоровИРеализаций.Добавить(МассивДоговоров);
		МассивДоговоровИРеализаций.Добавить(МассивРеализаций);
				
	КонецЦикла;
	
	Возврат МассивДоговоровИРеализаций;	
		
КонецФункции 
#КонецОбласти 
		
#КонецЕсли