#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий 
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)    
	
	Если ВыполненныеРаботы.Количество()<> 0 Тогда
		
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплате,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧаса КАК СтоимостьЧаса,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора КАК ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_НачалоДействияДоговора КАК НачалоДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ОкончаниеДействияДоговора КАК ОкончаниеДействияДоговора
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
		|		ПО ВКМ_ОбслуживаниеКлиентов.Ссылка = ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧаса,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_НачалоДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ОкончаниеДействияДоговора";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			
			АбоненскийДоговор = Выборка.ВидДоговора;
			
			Если АбоненскийДоговор <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
				СообщениеПользователю = "Проведение невозможно! Договор не соответствует виду ""Абонентское обслуживание""";
				ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю,,,,Отказ);
				Возврат;
			КонецЕсли;
			
			ДатаНачалаДог = Выборка.НачалоДействияДоговора;
			ДатаОкончанияДог = Выборка.ОкончаниеДействияДоговора;
			
			Если НЕ(Дата >= ДатаНачалаДог И Дата <= ДатаОкончанияДог) Тогда
				СообщениеПользователю = "Проведение невозможно! Дата обслуживания не входит в период действия абонентского договора";
				ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю,,,,Отказ);
				Возврат;
			КонецЕсли;
			
			Если Выборка.ЧасыКОплате = 0 Тогда
				Продолжить;
			КонецЕсли;  
			
			// движения по регистру ВКМ_ВыполненныеКлиентуРаботы
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = Выборка.ЧасыКОплате;
			Движение.СуммаКОплате = Выборка.ЧасыКОплате * Выборка.СтоимостьЧаса;
			
		КонецЦикла;  
		
		// проверка заполнения процента за выполненные работы у сотрудника 
		ПроцентОтРабот = ПолучитьПроцентЗаВыполненныеРаботы(Дата, Специалист);
		Если ПроцентОтРабот = Неопределено Тогда                                                                                
			СообщениеПользователю = СтрШаблон("Проведение невозможно! Не заполнен процент за выполненные работы у сотрудника %1", Специалист);
			ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		//Движения по регистру BKM_ВыполненныеСотрудникомРаботы
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = Выборка.ЧасыКОплате;
		Движение.СуммаКОплате = Движение.ЧасовКОплате * Выборка.СтоимостьЧаса * ПроцентОтРабот / 100; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		НовыйЭлементСправ = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлементСправ.Заполнить(Неопределено);
		НовыйЭлементСправ.ТекстСообщения = СтрШаблон("Создана новая заявка. Описание проблемы: %1.", ОписаниеПроблемы);
		НовыйЭлементСправ.Записать();  
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьПроцентЗаВыполненныеРаботы(Дата, Специалист)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентОтРабот;	
	Иначе   	
		Возврат Неопределено; 	
	КонецЕсли;
	
КонецФункции
#КонецОбласти 

#КонецЕсли   


