#Область ОбработчикиСобытийФормы
&НаСервере 

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.Адрес); 
	ЗаполнитьДиаграмму(ТаблицаДанных);
	
КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграмму(ТаблицаДанных)
	
	Диаграмма.Очистить(); 
	
	СерияОтпуска = Диаграмма.Серии.Добавить();
	СерияОтпуска.Текст = "Отпуск";
	СерияОтпуска.Цвет = WebЦвета.Бирюзовый;
	
	СерияДлительногоОтпуска = Диаграмма.Серии.Добавить();
	СерияДлительногоОтпуска.Текст = "Отпуск с продолжительностью более 28 дней";
	СерияДлительногоОтпуска.Цвет = WebЦвета.Коралловый;
	
	Для Каждого Строка из ТаблицаДанных Цикл
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Если Строка.ПродолжительностьОтпуска > 28 Тогда 
			Серия = СерияДлительногоОтпуска;
		Иначе
			Серия = СерияОтпуска;
		КонецЕсли; 
		
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;		
	КонецЦикла;	
	
КонецПроцедуры 

#КонецОбласти 
