#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ВидДоговора) Тогда
		ДобавитьПоляАбонентскогоДоговора();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	ДобавитьПоляАбонентскогоДоговора();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляАбонентскогоДоговора()
	
	//++ Цвелева Дарья Добавление полей ввода, если вид договора "Абоненское обслуживание"	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		ПолеВводаДатаНач = Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"));
		ПолеВводаДатаНач.Вид = ВидПоляФормы.ПолеПериода;
		ПолеВводаДатаНач.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		
		ПолеВводаДатаОкон = Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"));
		ПолеВводаДатаОкон.Вид = ВидПоляФормы.ПолеПериода;
		ПолеВводаДатаОкон.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";	
		
		ПолеВводаСтоимостьЧаса = Элементы.Добавить("СтоимостьЧаса", Тип("ПолеФормы"));
		ПолеВводаСтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаСтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
		
		ПолеВводаАбПлата = Элементы.Добавить("АбоненскаяПлата", Тип("ПолеФормы"));
		ПолеВводаАбПлата.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаАбПлата.ПутьКДанным = "Объект.ВКМ_АбоненскаяПлата";
		
	КонецЕсли;
	//--	
	
КонецПроцедуры

#КонецОбласти