#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаполнитьВыплаты(Команда) 
		
	Если Объект.Выплаты.Количество() <> 0 Тогда
		
		Результат = Ждать ВопросАсинх("Табличная часть будет очищена. Продолжить?", 
		РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;                
	
	Объект.Выплаты.Очистить();	
	ЗаполнитьВыплатыНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВыплатыНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток, 0) КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ДатаДокумента, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|ГДЕ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0";	
	
	Запрос.УстановитьПараметр("ДатаДокумента", КонецДня(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = "Отсутствуют данные о невыплаченной заработной плате!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл		
		ЗаполнитьЗначенияСвойств(Объект.Выплаты.Добавить(), Выборка);		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
